module.exports = {
  // arrowParens - нужно ли ставить скобки вокруг параметров функции, если их количество равно 1.
  // "avoid" означает, что скобки не нужны, "always" - что нужны.
  arrowParens: 'avoid',
  // bracketSameLine - располагать ли фигурные скобки на той же строке, что и оператор или на следующей строке.
  bracketSameLine: true,
  // bracketSpacing - нужны ли пробелы между фигурными скобками.
  bracketSpacing: false,
  // singleQuote - нужно ли использовать одинарные кавычки вместо двойных кавычек для строковых литералов.
  singleQuote: true,
  // trailingComma - нужна ли запятая после последнего элемента в массивах или объектах.
  // "all" означает, что запятые нужны везде, "es5" - только в ES5 и более новых версиях JavaScript.
  trailingComma: 'all',
};
